from db_manager import *

sec_list = [
    "القطاع الطبي والصحي",
    "القطاع الهندسي",
    "القطاع القانوني",
    "قطاع المطاعم والترفيه",
    "قطاع الادارة والاعمال والمحاسبة",
    "قطاع التعليمي",
    "قطاع الصحافة والاعلام والتلفزيون"
]

sec_cb = [
    "cb_med",
    "cb_eng",
    "cb_pol",
    "cb_res",
    "cb_man",
    "cb_org",
    "cb_jou",]

med_list = [
    'طبيب عام',
    'طبيب اختصاص',
    'طبيب استشاري',
    'طبيب اسنان عام', 
    'طبيب اسنان اختصاص', 
    'صيدلاني',
    'ممرض',  
    'تقني تحليلات', 
    'معاون مختبري', 
    'تقني تخدير', 
    'معاون تخدير', 
    'تقني صناعة اسنان', 
    'معاون صناعة اسنان', 
    'تقني اجهزة طبية', 
    'معهد اجهزة طبية', 
    'تقني فيزياء طبية', 
    'علوم ادلة جنائية', 
    'معاون صيدلي', 
    'معاون طبي', 
    'وقائي', 
    'علوم',
    "اخرى"]

eng_list = [
    'مهندس مدني', 
    'مهندس معماري',
    'مهندس طرق وجسور', 
    'مهندس طاقة', 
    'مهندس تصميم', 
    'مهندس كيميائي', 
    'مهندس تقنيات حياتية', 
    'مهندس ميكانيك', 
    'مهندس تقني', 
    'مهندس ديكور', 
    'مهندس زراعي', 
    'مهندس نظم ومعلومات', 
    'مهندس اجهزة طبية', 
    'مهندس حاسوب', 
    'مهندس شبكات', 
    'مهندس برمجيات', 
    'مهندس وراثة',
    "اخرى"]

leg_list = ['قاضي', 'محامي', 'مستشار قانوني', 'خبير قانوني', 'كاتب عدل', 'باحث قانوني', "اخرى"]

res_list = [
    'كاشير/محاسب', 'شيف(خلفة)', 
    'عامل تنظيف', 'كابتن صالة', 
    'موظف توصيل', 'موظف خدمة العملاء', "اخرى"]

man_list = [
    'مدير تنفيذي', 'مدير عام', 'مدير الموارد البشرية',
    'مدير انتاج', 'مدير مالي', 'مدير مبيعات', 'مدير تسويق',
    'مدير دعم فني', 'سكرتير', 'كاتب', 'محاسب', 'موظف مبيعات',
    'موظف موارد بشرية', 'نائب مدير عام', "اخرى"]

org_list = [
    'مدير مدرسة', 'معلم', 'مدرس', 
    'مرشد تربوي', 'استاذ جامعي', 'دكتور جامعي', 
    'امين مكتبة', 'معاون اداري', "اخرى"]

jou_list = [
    'مقدم برامج', 'مراسل', 
    'صحفي', 'مصور', 'مذيع', 
    'كاتب محتوى', 'مخرج', 
    'مساعد مخرج', 'منتج', 
    'صانع افلام', 'محرر', 
    'ممثل', "اخرى"]

all_list = [med_list, eng_list, leg_list, res_list, man_list, org_list, jou_list]



